read_verilog /workspace/examples/circuits/parity3.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /workspace/experiments/baseline/parity3/parity3_yosys
write_edif /workspace/experiments/baseline/parity3/parity3.edif
write_json /workspace/experiments/baseline/parity3/parity3.json
